//Модуль 1
//Задание 1
//Пользователь вводит с клавиатуры число в диапазоне от 1 до 100.
//Если число кратно 3 (делится на 3 без остатка) нужно вывести слово Fizz.
//Если число кратно 5 нужно вывести слово Buzz.
//Если число кратно 3 и 5 нужно вывести Fizz Buzz.
//Если число не кратно не 3 и 5 нужно вывести само число.
//Если пользователь ввел значение не в диапазоне от 1 до 100 требуется вывести сообщение об ошибке.


namespace hw_01_task1
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}